ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_gpio_ctrl_regs.xml
	<register id="GPAGMUX1" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="GPIO A Peripheral Group Mux (GPIO0 to 15)">
		<bitfield id="GPIO0" description="Defines pin-muxing selection for GPIO0" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Defines pin-muxing selection for GPIO1" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Defines pin-muxing selection for GPIO2" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Defines pin-muxing selection for GPIO3" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Defines pin-muxing selection for GPIO4" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Defines pin-muxing selection for GPIO5" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Defines pin-muxing selection for GPIO6" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Defines pin-muxing selection for GPIO7" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Defines pin-muxing selection for GPIO8" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Defines pin-muxing selection for GPIO9" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Defines pin-muxing selection for GPIO10" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Defines pin-muxing selection for GPIO11" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Defines pin-muxing selection for GPIO12" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Defines pin-muxing selection for GPIO13" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO14" description="Defines pin-muxing selection for GPIO14" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO15" description="Defines pin-muxing selection for GPIO15" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPAGMUX2" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="GPIO A Peripheral Group Mux (GPIO16 to 31)">
		<bitfield id="GPIO16" description="Defines pin-muxing selection for GPIO16" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Defines pin-muxing selection for GPIO17" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Defines pin-muxing selection for GPIO18" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Defines pin-muxing selection for GPIO19" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Defines pin-muxing selection for GPIO20" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Defines pin-muxing selection for GPIO21" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Defines pin-muxing selection for GPIO22" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Defines pin-muxing selection for GPIO23" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Defines pin-muxing selection for GPIO24" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO25" description="Defines pin-muxing selection for GPIO25" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO26" description="Defines pin-muxing selection for GPIO26" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO27" description="Defines pin-muxing selection for GPIO27" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Defines pin-muxing selection for GPIO28" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Defines pin-muxing selection for GPIO29" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO30" description="Defines pin-muxing selection for GPIO30" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO31" description="Defines pin-muxing selection for GPIO31" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPACSEL1" width="32" page="0" offset="0x50" instances="1" instaddr="4" internal="0" description="GPIO A Core Select Register (GPIO0 to 7)">
		<bitfield id="GPIO0" description="GPIO0 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO1" description="GPIO1 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO2" description="GPIO2 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO3" description="GPIO3 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO4" description="GPIO4 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO5" description="GPIO5 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO6" description="GPIO6 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO7" description="GPIO7 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPACSEL2" width="32" page="0" offset="0x54" instances="1" instaddr="4" internal="0" description="GPIO A Core Select Register (GPIO8 to 15)">
		<bitfield id="GPIO8" description="GPIO8 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO9" description="GPIO9 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO10" description="GPIO10 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO11" description="GPIO11 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO12" description="GPIO12 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO13" description="GPIO13 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO14" description="GPIO14 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO15" description="GPIO15 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPACSEL3" width="32" page="0" offset="0x58" instances="1" instaddr="4" internal="0" description="GPIO A Core Select Register (GPIO16 to 23)">
		<bitfield id="GPIO16" description="GPIO16 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO17" description="GPIO17 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO18" description="GPIO18 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO19" description="GPIO19 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO20" description="GPIO20 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO21" description="GPIO21 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO22" description="GPIO22 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO23" description="GPIO23 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
