ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_gpio_ctrl_regs.xml
	<register id="GPCQSEL1" width="32" page="0" offset="0x104" instances="1" instaddr="4" internal="0" description="GPIO C Qualifier Select 1 Register (GPIO64 to 79)">
		<bitfield id="GPIO64" description="Select input qualification type for GPIO64" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Select input qualification type for GPIO65" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Select input qualification type for GPIO66" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Select input qualification type for GPIO67" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Select input qualification type for GPIO68" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Select input qualification type for GPIO69" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Select input qualification type for GPIO70" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Select input qualification type for GPIO71" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Select input qualification type for GPIO72" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Select input qualification type for GPIO73" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Select input qualification type for GPIO74" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Select input qualification type for GPIO75" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Select input qualification type for GPIO76" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Select input qualification type for GPIO77" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Select input qualification type for GPIO78" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Select input qualification type for GPIO79" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPCQSEL2" width="32" page="0" offset="0x108" instances="1" instaddr="4" internal="0" description="GPIO C Qualifier Select 2 Register (GPIO80  to 95)">
		<bitfield id="GPIO80" description="Select input qualification type for GPIO80" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Select input qualification type for GPIO81" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Select input qualification type for GPIO82" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Select input qualification type for GPIO83" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Select input qualification type for GPIO84" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Select input qualification type for GPIO85" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Select input qualification type for GPIO86" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Select input qualification type for GPIO87" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Select input qualification type for GPIO88" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Select input qualification type for GPIO89" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Select input qualification type for GPIO90" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Select input qualification type for GPIO91" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Select input qualification type for GPIO92" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Select input qualification type for GPIO93" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Select input qualification type for GPIO94" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Select input qualification type for GPIO95" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPCMUX1" width="32" page="0" offset="0x10c" instances="1" instaddr="4" internal="0" description="GPIO C Mux 1 Register (GPIO64 to 79)">
		<bitfield id="GPIO64" description="Defines pin-muxing selection for GPIO64" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Defines pin-muxing selection for GPIO65" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Defines pin-muxing selection for GPIO66" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Defines pin-muxing selection for GPIO67" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Defines pin-muxing selection for GPIO68" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Defines pin-muxing selection for GPIO69" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Defines pin-muxing selection for GPIO70" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Defines pin-muxing selection for GPIO71" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Defines pin-muxing selection for GPIO72" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Defines pin-muxing selection for GPIO73" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Defines pin-muxing selection for GPIO74" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Defines pin-muxing selection for GPIO75" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Defines pin-muxing selection for GPIO76" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Defines pin-muxing selection for GPIO77" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Defines pin-muxing selection for GPIO78" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Defines pin-muxing selection for GPIO79" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPCMUX2" width="32" page="0" offset="0x110" instances="1" instaddr="4" internal="0" description="GPIO C Mux 2 Register (GPIO80  to 95)">
		<bitfield id="GPIO80" description="Defines pin-muxing selection for GPIO80" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Defines pin-muxing selection for GPIO81" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Defines pin-muxing selection for GPIO82" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Defines pin-muxing selection for GPIO83" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Defines pin-muxing selection for GPIO84" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Defines pin-muxing selection for GPIO85" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Defines pin-muxing selection for GPIO86" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Defines pin-muxing selection for GPIO87" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Defines pin-muxing selection for GPIO88" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Defines pin-muxing selection for GPIO89" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Defines pin-muxing selection for GPIO90" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Defines pin-muxing selection for GPIO91" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Defines pin-muxing selection for GPIO92" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Defines pin-muxing selection for GPIO93" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Defines pin-muxing selection for GPIO94" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Defines pin-muxing selection for GPIO95" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPCPUD" width="32" page="0" offset="0x118" instances="1" instaddr="4" internal="0" description="GPIO C Pull Up Disable Register (GPIO64 to 95) ">
		<bitfield id="GPIO64" description="Pull-Up Disable control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Pull-Up Disable control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Pull-Up Disable control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Pull-Up Disable control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Pull-Up Disable control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Pull-Up Disable control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Pull-Up Disable control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Pull-Up Disable control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Pull-Up Disable control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Pull-Up Disable control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Pull-Up Disable control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Pull-Up Disable control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Pull-Up Disable control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Pull-Up Disable control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Pull-Up Disable control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Pull-Up Disable control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Pull-Up Disable control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Pull-Up Disable control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Pull-Up Disable control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Pull-Up Disable control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Pull-Up Disable control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Pull-Up Disable control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Pull-Up Disable control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Pull-Up Disable control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Pull-Up Disable control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Pull-Up Disable control for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Pull-Up Disable control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Pull-Up Disable control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Pull-Up Disable control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Pull-Up Disable control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Pull-Up Disable control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPCINV" width="32" page="0" offset="0x120" instances="1" instaddr="4" internal="0" description="GPIO C Input Polarity Invert Registers (GPIO64 to 95)">
		<bitfield id="GPIO64" description="Input inversion control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Input inversion control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Input inversion control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Input inversion control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Input inversion control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Input inversion control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Input inversion control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Input inversion control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Input inversion control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Input inversion control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Input inversion control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Input inversion control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Input inversion control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Input inversion control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Input inversion control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Input inversion control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Input inversion control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Input inversion control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Input inversion control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Input inversion control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Input inversion control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Input inversion control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Input inversion control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Input inversion control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Input inversion control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Input inversion control for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Input inversion control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Input inversion control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Input inversion control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Input inversion control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Input inversion control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPCODR" width="32" page="0" offset="0x124" instances="1" instaddr="4" internal="0" description="GPIO C Open Drain Output Register (GPIO64 to GPIO95)">
		<bitfield id="GPIO64" description="Outpout Open-Drain control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Outpout Open-Drain control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Outpout Open-Drain control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Outpout Open-Drain control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Outpout Open-Drain control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Outpout Open-Drain control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Outpout Open-Drain control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Outpout Open-Drain control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Outpout Open-Drain control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Outpout Open-Drain control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Outpout Open-Drain control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Outpout Open-Drain control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Outpout Open-Drain control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Outpout Open-Drain control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Outpout Open-Drain control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Outpout Open-Drain control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Outpout Open-Drain control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Outpout Open-Drain control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Outpout Open-Drain control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Outpout Open-Drain control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Outpout Open-Drain control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Outpout Open-Drain control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Outpout Open-Drain control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Outpout Open-Drain control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Outpout Open-Drain control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Outpout Open-Drain control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Outpout Open-Drain control for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Outpout Open-Drain control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Outpout Open-Drain control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Outpout Open-Drain control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Outpout Open-Drain control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Outpout Open-Drain control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPCGMUX1" width="32" page="0" offset="0x140" instances="1" instaddr="4" internal="0" description="GPIO C Peripheral Group Mux (GPIO64 to 79)">
		<bitfield id="GPIO64" description="Defines pin-muxing selection for GPIO64" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Defines pin-muxing selection for GPIO65" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Defines pin-muxing selection for GPIO66" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Defines pin-muxing selection for GPIO67" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Defines pin-muxing selection for GPIO68" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Defines pin-muxing selection for GPIO69" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Defines pin-muxing selection for GPIO70" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Defines pin-muxing selection for GPIO71" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Defines pin-muxing selection for GPIO72" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Defines pin-muxing selection for GPIO73" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Defines pin-muxing selection for GPIO74" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Defines pin-muxing selection for GPIO75" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Defines pin-muxing selection for GPIO76" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Defines pin-muxing selection for GPIO77" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Defines pin-muxing selection for GPIO78" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Defines pin-muxing selection for GPIO79" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
