ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_gpio_ctrl_regs.xml
	<register id="GPCGMUX2" width="32" page="0" offset="0x144" instances="1" instaddr="4" internal="0" description="GPIO C Peripheral Group Mux (GPIO80  to 95)">
		<bitfield id="GPIO80" description="Defines pin-muxing selection for GPIO80" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Defines pin-muxing selection for GPIO81" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Defines pin-muxing selection for GPIO82" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Defines pin-muxing selection for GPIO83" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Defines pin-muxing selection for GPIO84" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Defines pin-muxing selection for GPIO85" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Defines pin-muxing selection for GPIO86" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Defines pin-muxing selection for GPIO87" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Defines pin-muxing selection for GPIO88" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Defines pin-muxing selection for GPIO89" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Defines pin-muxing selection for GPIO90" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Defines pin-muxing selection for GPIO91" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Defines pin-muxing selection for GPIO92" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Defines pin-muxing selection for GPIO93" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Defines pin-muxing selection for GPIO94" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Defines pin-muxing selection for GPIO95" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPCCSEL1" width="32" page="0" offset="0x150" instances="1" instaddr="4" internal="0" description="GPIO C Core Select Register (GPIO64 to 71)">
		<bitfield id="GPIO64" description="GPIO64 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO65" description="GPIO65 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO66" description="GPIO66 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO67" description="GPIO67 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO68" description="GPIO68 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO69" description="GPIO69 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO70" description="GPIO70 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO71" description="GPIO71 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPCCSEL2" width="32" page="0" offset="0x154" instances="1" instaddr="4" internal="0" description="GPIO C Core Select Register (GPIO72 to 79)">
		<bitfield id="GPIO72" description="GPIO72 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO73" description="GPIO73 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO74" description="GPIO74 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO75" description="GPIO75 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO76" description="GPIO76 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO77" description="GPIO77 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO78" description="GPIO78 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO79" description="GPIO79 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPCCSEL3" width="32" page="0" offset="0x158" instances="1" instaddr="4" internal="0" description="GPIO C Core Select Register (GPIO80  to 87)">
		<bitfield id="GPIO80" description="GPIO80 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO81" description="GPIO81 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO82" description="GPIO82 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO83" description="GPIO83 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO84" description="GPIO84 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO85" description="GPIO85 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO86" description="GPIO86 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO87" description="GPIO87 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPCCSEL4" width="32" page="0" offset="0x15c" instances="1" instaddr="4" internal="0" description="GPIO C Core Select Register (GPIO88 to 95)">
		<bitfield id="GPIO88" description="GPIO88 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO89" description="GPIO89 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO90" description="GPIO90 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO91" description="GPIO91 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO92" description="GPIO92 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO93" description="GPIO93 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO94" description="GPIO94 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO95" description="GPIO95 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
