ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_gpio_ctrl_regs.xml
	<register id="GPDQSEL2" width="32" page="0" offset="0x188" instances="1" instaddr="4" internal="0" description="GPIO D Qualifier Select 2 Register (GPIO112 to 127)">
		<bitfield id="GPIO127" description="Select input qualification type for GPIO127" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPDMUX1" width="32" page="0" offset="0x18c" instances="1" instaddr="4" internal="0" description="GPIO D Mux 1 Register (GPIO96 to 111)">
		<bitfield id="GPIO96" description="Defines pin-muxing selection for GPIO96" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Defines pin-muxing selection for GPIO97" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Defines pin-muxing selection for GPIO98" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Defines pin-muxing selection for GPIO99" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Defines pin-muxing selection for GPIO100" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Defines pin-muxing selection for GPIO101" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Defines pin-muxing selection for GPIO103" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Defines pin-muxing selection for GPIO105" begin="19" end="18" width="2" rwaccess="RW"/>
	</register>
	<register id="GPDMUX2" width="32" page="0" offset="0x190" instances="1" instaddr="4" internal="0" description="GPIO D Mux 2 Register (GPIO112 to 127)">
		<bitfield id="GPIO127" description="Defines pin-muxing selection for GPIO127" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPDPUD" width="32" page="0" offset="0x198" instances="1" instaddr="4" internal="0" description="GPIO D Pull Up Disable Register (GPIO96 to 127) ">
		<bitfield id="GPIO96" description="Pull-Up Disable control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Pull-Up Disable control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Pull-Up Disable control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Pull-Up Disable control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Pull-Up Disable control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Pull-Up Disable control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Pull-Up Disable control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO127" description="Pull-Up Disable control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPDINV" width="32" page="0" offset="0x1a0" instances="1" instaddr="4" internal="0" description="GPIO D Input Polarity Invert Registers (GPIO96 to 127)">
		<bitfield id="GPIO96" description="Input inversion control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Input inversion control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Input inversion control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Input inversion control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Input inversion control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Input inversion control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Input inversion control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO127" description="Input inversion control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPDODR" width="32" page="0" offset="0x1a4" instances="1" instaddr="4" internal="0" description="GPIO D Open Drain Output Register (GPIO96 to GPIO127)">
		<bitfield id="GPIO96" description="Outpout Open-Drain control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Outpout Open-Drain control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Outpout Open-Drain control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Outpout Open-Drain control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Outpout Open-Drain control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Outpout Open-Drain control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Outpout Open-Drain control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Outpout Open-Drain control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO127" description="Outpout Open-Drain control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPDGMUX1" width="32" page="0" offset="0x1c0" instances="1" instaddr="4" internal="0" description="GPIO D Peripheral Group Mux (GPIO96 to 111)">
		<bitfield id="GPIO96" description="Defines pin-muxing selection for GPIO96" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Defines pin-muxing selection for GPIO97" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Defines pin-muxing selection for GPIO98" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Defines pin-muxing selection for GPIO99" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Defines pin-muxing selection for GPIO100" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Defines pin-muxing selection for GPIO101" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Defines pin-muxing selection for GPIO103" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Defines pin-muxing selection for GPIO105" begin="19" end="18" width="2" rwaccess="RW"/>
	</register>
