ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_gpio_ctrl_regs.xml
	<register id="GPDGMUX2" width="32" page="0" offset="0x1c4" instances="1" instaddr="4" internal="0" description="GPIO D Peripheral Group Mux (GPIO112 to 127)">
		<bitfield id="GPIO127" description="Defines pin-muxing selection for GPIO127" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPDCSEL1" width="32" page="0" offset="0x1d0" instances="1" instaddr="4" internal="0" description="GPIO D Core Select Register (GPIO96 to 103)">
		<bitfield id="GPIO96" description="GPIO96 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO97" description="GPIO97 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO98" description="GPIO98 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO99" description="GPIO99 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO100" description="GPIO100 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO101" description="GPIO101 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO103" description="GPIO103 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPDCSEL2" width="32" page="0" offset="0x1d4" instances="1" instaddr="4" internal="0" description="GPIO D Core Select Register (GPIO104 to 111)">
		<bitfield id="GPIO105" description="GPIO105 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
	</register>
	<register id="GPDCSEL3" width="32" page="0" offset="0x1d8" instances="1" instaddr="4" internal="0" description="GPIO D Core Select Register (GPIO112 to 119)">
	</register>
	<register id="GPDCSEL4" width="32" page="0" offset="0x1dc" instances="1" instaddr="4" internal="0" description="GPIO D Core Select Register (GPIO120 to 127)">
		<bitfield id="GPIO127" description="GPIO127 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPDLOCK" width="32" page="0" offset="0x1f8" instances="1" instaddr="4" internal="0" description="GPIO D Lock Configuration Register (GPIO96 to 127)">
		<bitfield id="GPIO96" description="Configuration Lock bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Configuration Lock bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Configuration Lock bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Configuration Lock bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Configuration Lock bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Configuration Lock bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Configuration Lock bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Configuration Lock bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO127" description="Configuration Lock bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPDCR" width="32" page="0" offset="0x1fc" instances="1" instaddr="4" internal="0" description="GPIO D Lock Commit Register (GPIO96 to 127)">
		<bitfield id="GPIO96" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Configuration lock commit bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Configuration lock commit bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO127" description="Configuration lock commit bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPFCTRL" width="32" page="0" offset="0x280" instances="1" instaddr="4" internal="0" description="GPIO F Qualification Sampling Period Control (GPIO160 to 191)">
		<bitfield id="QUALPRD0" description="Qualification sampling period for GPIO160 to GPIO167" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD1" description="Qualification sampling period for GPIO168" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD2" description="Qualification sampling period for GPIO176 to GPIO183" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD3" description="Qualification sampling period for GPIO184 to GPIO191" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="GPFQSEL1" width="32" page="0" offset="0x284" instances="1" instaddr="4" internal="0" description="GPIO F Qualifier Select 1 Register (GPIO160 to 168)">
		<bitfield id="GPIO160" description="Select input qualification type for GPIO160" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Select input qualification type for GPIO161" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Select input qualification type for GPIO162" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Select input qualification type for GPIO163" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Select input qualification type for GPIO164" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Select input qualification type for GPIO165" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Select input qualification type for GPIO166" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Select input qualification type for GPIO167" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Select input qualification type for GPIO168" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO169" description="Select input qualification type for GPIO169" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO170" description="Select input qualification type for GPIO170" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO171" description="Select input qualification type for GPIO171" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO172" description="Select input qualification type for GPIO172" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO173" description="Select input qualification type for GPIO173" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO174" description="Select input qualification type for GPIO174" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO175" description="Select input qualification type for GPIO175" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
