ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_gpio_ctrl_regs.xml
	<register id="GPFQSEL2" width="32" page="0" offset="0x288" instances="1" instaddr="4" internal="0" description="GPIO F Qualifier Select 2 Register (GPIO176 to 191)">
		<bitfield id="GPIO176" description="Select input qualification type for GPIO176" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO177" description="Select input qualification type for GPIO177" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO178" description="Select input qualification type for GPIO178" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO179" description="Select input qualification type for GPIO179" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO180" description="Select input qualification type for GPIO180" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO181" description="Select input qualification type for GPIO181" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO182" description="Select input qualification type for GPIO182" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO183" description="Select input qualification type for GPIO183" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO184" description="Select input qualification type for GPIO184" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO185" description="Select input qualification type for GPIO185" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO186" description="Select input qualification type for GPIO186" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO187" description="Select input qualification type for GPIO187" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO188" description="Select input qualification type for GPIO188" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO189" description="Select input qualification type for GPIO189" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO190" description="Select input qualification type for GPIO190" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO191" description="Select input qualification type for GPIO191" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPFMUX1" width="32" page="0" offset="0x28c" instances="1" instaddr="4" internal="0" description="GPIO F Mux 1 Register (GPIO160 to 175)">
		<bitfield id="GPIO160" description="Defines pin-muxing selection for GPIO160" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Defines pin-muxing selection for GPIO161" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Defines pin-muxing selection for GPIO162" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Defines pin-muxing selection for GPIO163" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Defines pin-muxing selection for GPIO164" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Defines pin-muxing selection for GPIO165" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Defines pin-muxing selection for GPIO166" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Defines pin-muxing selection for GPIO167" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Defines pin-muxing selection for GPIO168" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO169" description="Defines pin-muxing selection for GPIO169" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO170" description="Defines pin-muxing selection for GPIO170" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO171" description="Defines pin-muxing selection for GPIO171" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO172" description="Defines pin-muxing selection for GPIO172" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO173" description="Defines pin-muxing selection for GPIO173" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO174" description="Defines pin-muxing selection for GPIO174" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO175" description="Defines pin-muxing selection for GPIO175" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPFMUX2" width="32" page="0" offset="0x290" instances="1" instaddr="4" internal="0" description="GPIO F Mux 2 Register (GPIO176 to 191)">
		<bitfield id="GPIO176" description="Defines pin-muxing selection for GPIO176" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO177" description="Defines pin-muxing selection for GPIO177" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO178" description="Defines pin-muxing selection for GPIO178" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO179" description="Defines pin-muxing selection for GPIO179" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO180" description="Defines pin-muxing selection for GPIO180" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO181" description="Defines pin-muxing selection for GPIO181" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO182" description="Defines pin-muxing selection for GPIO182" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO183" description="Defines pin-muxing selection for GPIO183" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO184" description="Defines pin-muxing selection for GPIO184" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO185" description="Defines pin-muxing selection for GPIO185" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO186" description="Defines pin-muxing selection for GPIO186" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO187" description="Defines pin-muxing selection for GPIO187" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO188" description="Defines pin-muxing selection for GPIO188" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO189" description="Defines pin-muxing selection for GPIO189" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO190" description="Defines pin-muxing selection for GPIO190" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO191" description="Defines pin-muxing selection for GPIO191" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPFPUD" width="32" page="0" offset="0x298" instances="1" instaddr="4" internal="0" description="GPIO F Pull Up Disable Register (GPIO160 to 191) ">
		<bitfield id="GPIO160" description="Pull-Up Disable control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Pull-Up Disable control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Pull-Up Disable control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Pull-Up Disable control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Pull-Up Disable control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Pull-Up Disable control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Pull-Up Disable control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Pull-Up Disable control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO169" description="Pull-Up Disable control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO170" description="Pull-Up Disable control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO171" description="Pull-Up Disable control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO172" description="Pull-Up Disable control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO173" description="Pull-Up Disable control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO174" description="Pull-Up Disable control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO175" description="Pull-Up Disable control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO176" description="Pull-Up Disable control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO177" description="Pull-Up Disable control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO178" description="Pull-Up Disable control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO179" description="Pull-Up Disable control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO180" description="Pull-Up Disable control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO181" description="Pull-Up Disable control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO182" description="Pull-Up Disable control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO183" description="Pull-Up Disable control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO184" description="Pull-Up Disable control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO185" description="Pull-Up Disable control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO186" description="Pull-Up Disable control for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO187" description="Pull-Up Disable control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO188" description="Pull-Up Disable control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO189" description="Pull-Up Disable control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO190" description="Pull-Up Disable control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO191" description="Pull-Up Disable control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
