ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_gpio_ctrl_regs.xml
	<register id="GPFINV" width="32" page="0" offset="0x2a0" instances="1" instaddr="4" internal="0" description="GPIO F Input Polarity Invert Registers (GPIO160 to 191)">
		<bitfield id="GPIO160" description="Input inversion control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Input inversion control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Input inversion control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Input inversion control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Input inversion control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Input inversion control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Input inversion control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Input inversion control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO169" description="Input inversion control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO170" description="Input inversion control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO171" description="Input inversion control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO172" description="Input inversion control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO173" description="Input inversion control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO174" description="Input inversion control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO175" description="Input inversion control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO176" description="Input inversion control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO177" description="Input inversion control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO178" description="Input inversion control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO179" description="Input inversion control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO180" description="Input inversion control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO181" description="Input inversion control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO182" description="Input inversion control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO183" description="Input inversion control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO184" description="Input inversion control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO185" description="Input inversion control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO186" description="Input inversion control for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO187" description="Input inversion control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO188" description="Input inversion control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO189" description="Input inversion control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO190" description="Input inversion control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO191" description="Input inversion control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPFAMSEL" width="32" page="0" offset="0x2a8" instances="1" instaddr="4" internal="0" description="GPIO F Analog Mode Select register (GPIO160 to GPIO191)">
		<bitfield id="GPIO160" description="Analog Mode select for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Analog Mode select for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Analog Mode select for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Analog Mode select for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Analog Mode select for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Analog Mode select for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Analog Mode select for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Analog Mode select for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Analog Mode select for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO169" description="Analog Mode select for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO170" description="Analog Mode select for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO171" description="Analog Mode select for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO172" description="Analog Mode select for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO173" description="Analog Mode select for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO174" description="Analog Mode select for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO175" description="Analog Mode select for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO176" description="Analog Mode select for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO177" description="Analog Mode select for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO178" description="Analog Mode select for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO179" description="Analog Mode select for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO180" description="Analog Mode select for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO181" description="Analog Mode select for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO182" description="Analog Mode select for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO183" description="Analog Mode select for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO184" description="Analog Mode select for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO185" description="Analog Mode select for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO186" description="Analog Mode select for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO187" description="Analog Mode select for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO188" description="Analog Mode select for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO189" description="Analog Mode select for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO190" description="Analog Mode select for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO191" description="Analog Mode select for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPFGMUX1" width="32" page="0" offset="0x2c0" instances="1" instaddr="4" internal="0" description="GPIO F Peripheral Group Mux (GPIO160 to 175)">
		<bitfield id="GPIO160" description="Defines pin-muxing selection for GPIO160" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Defines pin-muxing selection for GPIO161" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Defines pin-muxing selection for GPIO162" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Defines pin-muxing selection for GPIO163" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Defines pin-muxing selection for GPIO164" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Defines pin-muxing selection for GPIO165" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Defines pin-muxing selection for GPIO166" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Defines pin-muxing selection for GPIO167" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Defines pin-muxing selection for GPIO168" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO169" description="Defines pin-muxing selection for GPIO169" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO170" description="Defines pin-muxing selection for GPIO170" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO171" description="Defines pin-muxing selection for GPIO171" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO172" description="Defines pin-muxing selection for GPIO172" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO173" description="Defines pin-muxing selection for GPIO173" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO174" description="Defines pin-muxing selection for GPIO174" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO175" description="Defines pin-muxing selection for GPIO175" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPFGMUX2" width="32" page="0" offset="0x2c4" instances="1" instaddr="4" internal="0" description="GPIO F Peripheral Group Mux (GPIO176 to 191)">
		<bitfield id="GPIO176" description="Defines pin-muxing selection for GPIO176" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO177" description="Defines pin-muxing selection for GPIO177" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO178" description="Defines pin-muxing selection for GPIO178" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO179" description="Defines pin-muxing selection for GPIO179" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO180" description="Defines pin-muxing selection for GPIO180" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO181" description="Defines pin-muxing selection for GPIO181" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO182" description="Defines pin-muxing selection for GPIO182" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO183" description="Defines pin-muxing selection for GPIO183" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO184" description="Defines pin-muxing selection for GPIO184" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO185" description="Defines pin-muxing selection for GPIO185" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO186" description="Defines pin-muxing selection for GPIO186" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO187" description="Defines pin-muxing selection for GPIO187" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO188" description="Defines pin-muxing selection for GPIO188" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO189" description="Defines pin-muxing selection for GPIO189" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO190" description="Defines pin-muxing selection for GPIO190" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO191" description="Defines pin-muxing selection for GPIO191" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPFCSEL1" width="32" page="0" offset="0x2d0" instances="1" instaddr="4" internal="0" description="GPIO F Core Select Register (GPIO160 to 167)">
		<bitfield id="GPIO160" description="GPIO160 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO161" description="GPIO161 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO162" description="GPIO162 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO163" description="GPIO163 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO164" description="GPIO164 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO165" description="GPIO165 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO166" description="GPIO166 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO167" description="GPIO167 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
