ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_gpio_ctrl_regs.xml
	<register id="GPGCTRL" width="32" page="0" offset="0x300" instances="1" instaddr="4" internal="0" description="GPIO G Qualification Sampling Period Control (GPIO192 to 223)">
		<bitfield id="QUALPRD0" description="Qualification sampling period for GPIO192 to GPIO199" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD1" description="Qualification sampling period for GPIO200 to GPIO207" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD2" description="Qualification sampling period for GPIO208 to GPIO215" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD3" description="Qualification sampling period for GPIO216 to GPIO223" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="GPGQSEL1" width="32" page="0" offset="0x304" instances="1" instaddr="4" internal="0" description="GPIO G Qualifier Select 1 Register (GPIO192 to 207)">
		<bitfield id="GPIO192" description="Select input qualification type for GPIO192" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO193" description="Select input qualification type for GPIO193" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO194" description="Select input qualification type for GPIO194" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO195" description="Select input qualification type for GPIO195" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO196" description="Select input qualification type for GPIO196" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO197" description="Select input qualification type for GPIO197" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO198" description="Select input qualification type for GPIO198" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Select input qualification type for GPIO199" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Select input qualification type for GPIO200" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Select input qualification type for GPIO201" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Select input qualification type for GPIO202" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Select input qualification type for GPIO203" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Select input qualification type for GPIO204" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Select input qualification type for GPIO205" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Select input qualification type for GPIO206" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Select input qualification type for GPIO207" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPGQSEL2" width="32" page="0" offset="0x308" instances="1" instaddr="4" internal="0" description="GPIO G Qualifier Select 2 Register (GPIO208 to 223)">
		<bitfield id="GPIO208" description="Select input qualification type for GPIO208" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Select input qualification type for GPIO209" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Select input qualification type for GPIO210" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Select input qualification type for GPIO211" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Select input qualification type for GPIO212" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Select input qualification type for GPIO213" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Select input qualification type for GPIO219" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Select input qualification type for GPIO220" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Select input qualification type for GPIO221" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Select input qualification type for GPIO222" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Select input qualification type for GPIO223" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPGMUX1" width="32" page="0" offset="0x30c" instances="1" instaddr="4" internal="0" description="GPIO G Mux 1 Register (GPIO192 to 207)">
		<bitfield id="GPIO192" description="Defines pin-muxing selection for GPIO192" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO193" description="Defines pin-muxing selection for GPIO193" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO194" description="Defines pin-muxing selection for GPIO194" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO195" description="Defines pin-muxing selection for GPIO195" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO196" description="Defines pin-muxing selection for GPIO196" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO197" description="Defines pin-muxing selection for GPIO197" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO198" description="Defines pin-muxing selection for GPIO198" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Defines pin-muxing selection for GPIO199" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Defines pin-muxing selection for GPIO200" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Defines pin-muxing selection for GPIO201" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Defines pin-muxing selection for GPIO202" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Defines pin-muxing selection for GPIO203" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Defines pin-muxing selection for GPIO204" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Defines pin-muxing selection for GPIO205" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Defines pin-muxing selection for GPIO206" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Defines pin-muxing selection for GPIO207" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
