ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_gpio_ctrl_regs.xml
	<register id="GPGMUX2" width="32" page="0" offset="0x310" instances="1" instaddr="4" internal="0" description="GPIO G Mux 2 Register (GPIO208 to 223)">
		<bitfield id="GPIO208" description="Defines pin-muxing selection for GPIO208" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Defines pin-muxing selection for GPIO209" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Defines pin-muxing selection for GPIO210" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Defines pin-muxing selection for GPIO211" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Defines pin-muxing selection for GPIO212" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Defines pin-muxing selection for GPIO213" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Defines pin-muxing selection for GPIO219" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Defines pin-muxing selection for GPIO220" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Defines pin-muxing selection for GPIO221" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Defines pin-muxing selection for GPIO222" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Defines pin-muxing selection for GPIO223" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPGPUD" width="32" page="0" offset="0x318" instances="1" instaddr="4" internal="0" description="GPIO G Pull Up Disable Register (GPIO192 to 223) ">
		<bitfield id="GPIO192" description="Pull-Up Disable control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO193" description="Pull-Up Disable control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO194" description="Pull-Up Disable control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO195" description="Pull-Up Disable control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO196" description="Pull-Up Disable control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO197" description="Pull-Up Disable control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO198" description="Pull-Up Disable control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Pull-Up Disable control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Pull-Up Disable control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Pull-Up Disable control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Pull-Up Disable control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Pull-Up Disable control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Pull-Up Disable control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Pull-Up Disable control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Pull-Up Disable control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO208" description="Pull-Up Disable control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Pull-Up Disable control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Pull-Up Disable control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Pull-Up Disable control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Pull-Up Disable control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Pull-Up Disable control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Pull-Up Disable control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Pull-Up Disable control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Pull-Up Disable control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Pull-Up Disable control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Pull-Up Disable control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPGINV" width="32" page="0" offset="0x320" instances="1" instaddr="4" internal="0" description="GPIO G Input Polarity Invert Registers (GPIO192 to 223)">
		<bitfield id="GPIO192" description="Input inversion control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO193" description="Input inversion control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO194" description="Input inversion control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO195" description="Input inversion control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO196" description="Input inversion control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO197" description="Input inversion control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO198" description="Input inversion control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Input inversion control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Input inversion control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Input inversion control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Input inversion control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Input inversion control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Input inversion control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Input inversion control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Input inversion control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO208" description="Input inversion control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Input inversion control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Input inversion control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Input inversion control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Input inversion control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Input inversion control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Input inversion control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Input inversion control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Input inversion control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Input inversion control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Input inversion control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPGODR" width="32" page="0" offset="0x324" instances="1" instaddr="4" internal="0" description="GPIO G Open Drain Output Register (GPIO192 to 223)">
		<bitfield id="GPIO219" description="Outpout Open-Drain control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Outpout Open-Drain control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Outpout Open-Drain control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Outpout Open-Drain control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Outpout Open-Drain control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPGAMSEL" width="32" page="0" offset="0x328" instances="1" instaddr="4" internal="0" description="GPIO G Analog Mode Select register (GPIO192 to 223)">
		<bitfield id="GPIO192" description="Analog Mode select for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO193" description="Analog Mode select for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO194" description="Analog Mode select for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO195" description="Analog Mode select for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO196" description="Analog Mode select for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO197" description="Analog Mode select for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO198" description="Analog Mode select for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Analog Mode select for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Analog Mode select for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Analog Mode select for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Analog Mode select for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Analog Mode select for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Analog Mode select for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Analog Mode select for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Analog Mode select for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Analog Mode select for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO208" description="Analog Mode select for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Analog Mode select for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Analog Mode select for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Analog Mode select for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Analog Mode select for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Analog Mode select for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
	</register>
	<register id="GPGGMUX1" width="32" page="0" offset="0x340" instances="1" instaddr="4" internal="0" description="GPIO G Peripheral Group Mux (GPIO192 to 207)">
		<bitfield id="GPIO192" description="Defines pin-muxing selection for GPIO192" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO193" description="Defines pin-muxing selection for GPIO193" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO194" description="Defines pin-muxing selection for GPIO194" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO195" description="Defines pin-muxing selection for GPIO195" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO196" description="Defines pin-muxing selection for GPIO196" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO197" description="Defines pin-muxing selection for GPIO197" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO198" description="Defines pin-muxing selection for GPIO198" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Defines pin-muxing selection for GPIO199" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Defines pin-muxing selection for GPIO200" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Defines pin-muxing selection for GPIO201" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Defines pin-muxing selection for GPIO202" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Defines pin-muxing selection for GPIO203" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Defines pin-muxing selection for GPIO204" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Defines pin-muxing selection for GPIO205" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Defines pin-muxing selection for GPIO206" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Defines pin-muxing selection for GPIO207" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPGGMUX2" width="32" page="0" offset="0x344" instances="1" instaddr="4" internal="0" description="GPIO G Peripheral Group Mux (GPIO208 to 223)">
		<bitfield id="GPIO208" description="Defines pin-muxing selection for GPIO208" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Defines pin-muxing selection for GPIO209" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Defines pin-muxing selection for GPIO210" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Defines pin-muxing selection for GPIO211" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Defines pin-muxing selection for GPIO212" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Defines pin-muxing selection for GPIO213" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Defines pin-muxing selection for GPIO219" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Defines pin-muxing selection for GPIO220" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Defines pin-muxing selection for GPIO221" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Defines pin-muxing selection for GPIO222" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Defines pin-muxing selection for GPIO223" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPGCSEL1" width="32" page="0" offset="0x350" instances="1" instaddr="4" internal="0" description="GPIO G Core Select Register (GPIO192 to 199)">
		<bitfield id="GPIO192" description="GPIO192 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO193" description="GPIO193 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO194" description="GPIO194 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO195" description="GPIO195 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO196" description="GPIO196 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO197" description="GPIO197 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO198" description="GPIO198 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO199" description="GPIO199 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPGCSEL2" width="32" page="0" offset="0x354" instances="1" instaddr="4" internal="0" description="GPIO G Core Select Register (GPIO200 to 207)">
		<bitfield id="GPIO200" description="GPIO200 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO201" description="GPIO201 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO202" description="GPIO202 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO203" description="GPIO203 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO204" description="GPIO204 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO205" description="GPIO205 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO206" description="GPIO206 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO207" description="GPIO207 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPGCSEL3" width="32" page="0" offset="0x358" instances="1" instaddr="4" internal="0" description="GPIO G Core Select Register (GPIO208 to 215)">
		<bitfield id="GPIO208" description="GPIO208 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO209" description="GPIO209 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO210" description="GPIO210 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO211" description="GPIO211 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO212" description="GPIO212 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO213" description="GPIO213 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
	</register>
	<register id="GPGCSEL4" width="32" page="0" offset="0x35c" instances="1" instaddr="4" internal="0" description="GPIO G Core Select Register (GPIO216 to 223)">
		<bitfield id="GPIO219" description="GPIO219 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO220" description="GPIO220 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO221" description="GPIO221 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO222" description="GPIO222 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO223" description="GPIO223 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPGLOCK" width="32" page="0" offset="0x378" instances="1" instaddr="4" internal="0" description="GPIO G Lock Configuration Register (GPIO192 to 223)">
		<bitfield id="GPIO192" description="Configuration Lock bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO193" description="Configuration Lock bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO194" description="Configuration Lock bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO195" description="Configuration Lock bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO196" description="Configuration Lock bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO197" description="Configuration Lock bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO198" description="Configuration Lock bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Configuration Lock bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Configuration Lock bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Configuration Lock bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Configuration Lock bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Configuration Lock bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Configuration Lock bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Configuration Lock bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Configuration Lock bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Configuration Lock bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO208" description="Configuration Lock bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Configuration Lock bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Configuration Lock bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Configuration Lock bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Configuration Lock bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Configuration Lock bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Configuration Lock bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Configuration Lock bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Configuration Lock bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Configuration Lock bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Configuration Lock bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
