ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_gpio_ctrl_regs.xml
	<register id="GPGCR" width="32" page="0" offset="0x37c" instances="1" instaddr="4" internal="0" description="GPIO G Lock Commit Register (GPIO192 to 223)">
		<bitfield id="GPIO192" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO193" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO194" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO195" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO196" description="Configuration lock commit bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO197" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO198" description="Configuration lock commit bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Configuration lock commit bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Configuration lock commit bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Configuration lock commit bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Configuration lock commit bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Configuration lock commit bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Configuration lock commit bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Configuration lock commit bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Configuration lock commit bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO208" description="Configuration lock commit bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Configuration lock commit bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Configuration lock commit bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Configuration lock commit bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Configuration lock commit bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Configuration lock commit bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Configuration lock commit bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Configuration lock commit bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Configuration lock commit bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Configuration lock commit bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Configuration lock commit bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHCTRL" width="32" page="0" offset="0x380" instances="1" instaddr="4" internal="0" description="GPIO H Qualification Sampling Period Control (GPIO224 to 255)">
		<bitfield id="QUALPRD0" description="Qualification sampling period for GPIO224 to GPIO231" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD1" description="Qualification sampling period for GPIO232 to GPIO239" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD2" description="Qualification sampling period for GPIO240 to GPIO247" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD3" description="Qualification sampling period for GPIO248 to GPIO255" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="GPHQSEL1" width="32" page="0" offset="0x384" instances="1" instaddr="4" internal="0" description="GPIO H Qualifier Select 1 Register (GPIO224 to 239)">
		<bitfield id="GPIO224" description="Select input qualification type for this GPIO Pin" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Select input qualification type for this GPIO Pin" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Select input qualification type for this GPIO Pin" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Select input qualification type for this GPIO Pin" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Select input qualification type for this GPIO Pin" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Select input qualification type for this GPIO Pin" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Select input qualification type for this GPIO Pin" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Select input qualification type for this GPIO Pin" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Select input qualification type for this GPIO Pin" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Select input qualification type for this GPIO Pin" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Select input qualification type for this GPIO Pin" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Select input qualification type for this GPIO Pin" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Select input qualification type for this GPIO Pin" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Select input qualification type for this GPIO Pin" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Select input qualification type for this GPIO Pin" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Select input qualification type for this GPIO Pin" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHQSEL2" width="32" page="0" offset="0x388" instances="1" instaddr="4" internal="0" description="GPIO H Qualifier Select 2 Register (GPIO240 to 255)">
		<bitfield id="GPIO240" description="Select input qualification type for this GPIO Pin" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Select input qualification type for this GPIO Pin" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Select input qualification type for this GPIO Pin" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO243" description="Select input qualification type for this GPIO Pin" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Select input qualification type for this GPIO Pin" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Select input qualification type for this GPIO Pin" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO246" description="Select input qualification type for this GPIO Pin" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Select input qualification type for this GPIO Pin" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO248" description="Select input qualification type for this GPIO Pin" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO249" description="Select input qualification type for this GPIO Pin" begin="19" end="18" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHMUX1" width="32" page="0" offset="0x38c" instances="1" instaddr="4" internal="0" description="GPIO H Mux 1 Register (GPIO224 to 239)">
		<bitfield id="GPIO224" description="Defines pin-muxing selection for GPIO224" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Defines pin-muxing selection for GPIO225" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Defines pin-muxing selection for GPIO226" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Defines pin-muxing selection for GPIO227" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Defines pin-muxing selection for GPIO228" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Defines pin-muxing selection for GPIO229" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Defines pin-muxing selection for GPIO230" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Defines pin-muxing selection for GPIO231" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Defines pin-muxing selection for GPIO232" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Defines pin-muxing selection for GPIO233" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Defines pin-muxing selection for GPIO234" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Defines pin-muxing selection for GPIO235" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Defines pin-muxing selection for GPIO236" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Defines pin-muxing selection for GPIO237" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Defines pin-muxing selection for GPIO238" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Defines pin-muxing selection for GPIO239" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHMUX2" width="32" page="0" offset="0x390" instances="1" instaddr="4" internal="0" description="GPIO H Mux 2 Register (GPIO240 to 255)">
		<bitfield id="GPIO240" description="Defines pin-muxing selection for GPIO240" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Defines pin-muxing selection for GPIO241" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Defines pin-muxing selection for GPIO242" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO243" description="Defines pin-muxing selection for GPIO243" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Defines pin-muxing selection for GPIO244" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Defines pin-muxing selection for GPIO245" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO246" description="Defines pin-muxing selection for GPIO246" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Defines pin-muxing selection for GPIO247" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO248" description="Defines pin-muxing selection for GPIO248" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO249" description="Defines pin-muxing selection for GPIO249" begin="19" end="18" width="2" rwaccess="RW"/>
	</register>
