ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_gpio_ctrl_regs.xml
	<register id="GPHGMUX2" width="32" page="0" offset="0x3c4" instances="1" instaddr="4" internal="0" description="GPIO H Peripheral Group Mux (GPIO240 to 255)">
		<bitfield id="GPIO240" description="Defines pin-muxing selection for GPIO240" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Defines pin-muxing selection for GPIO241" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Defines pin-muxing selection for GPIO242" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO243" description="Defines pin-muxing selection for GPIO243" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Defines pin-muxing selection for GPIO244" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Defines pin-muxing selection for GPIO245" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO246" description="Defines pin-muxing selection for GPIO246" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Defines pin-muxing selection for GPIO247" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO248" description="Defines pin-muxing selection for GPIO248" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO249" description="Defines pin-muxing selection for GPIO249" begin="19" end="18" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHCSEL1" width="32" page="0" offset="0x3d0" instances="1" instaddr="4" internal="0" description="GPIO H Core Select Register (GPIO224 to 231)">
		<bitfield id="GPIO224" description="GPIO224 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO225" description="GPIO225 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO226" description="GPIO226 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO227" description="GPIO227 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO228" description="GPIO228 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO229" description="GPIO229 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO230" description="GPIO230 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO231" description="GPIO231 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPHCSEL2" width="32" page="0" offset="0x3d4" instances="1" instaddr="4" internal="0" description="GPIO H Core Select Register (GPIO232 to 239)">
		<bitfield id="GPIO232" description="GPIO232 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO233" description="GPIO233 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO234" description="GPIO234 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO235" description="GPIO235 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO236" description="GPIO236 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO237" description="GPIO237 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO238" description="GPIO238 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO239" description="GPIO239 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPHCSEL3" width="32" page="0" offset="0x3d8" instances="1" instaddr="4" internal="0" description="GPIO H Core Select Register (GPIO240 to 247)">
		<bitfield id="GPIO240" description="GPIO240 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO241" description="GPIO241 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO242" description="GPIO242 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO243" description="GPIO243 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO244" description="GPIO244 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO245" description="GPIO245 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO246" description="GPIO246 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO247" description="GPIO247 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPHCSEL4" width="32" page="0" offset="0x3dc" instances="1" instaddr="4" internal="0" description="GPIO H Core Select Register (GPIO248 to 255)">
		<bitfield id="GPIO248" description="GPIO248 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO249" description="GPIO249 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
	</register>
	<register id="GPHLOCK" width="32" page="0" offset="0x3f8" instances="1" instaddr="4" internal="0" description="GPIO H Lock Configuration Register (GPIO224 to 255)">
		<bitfield id="GPIO224" description="Configuration Lock bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Configuration Lock bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Configuration Lock bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Configuration Lock bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Configuration Lock bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Configuration Lock bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Configuration Lock bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Configuration Lock bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Configuration Lock bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Configuration Lock bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Configuration Lock bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Configuration Lock bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Configuration Lock bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Configuration Lock bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Configuration Lock bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Configuration Lock bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="Configuration Lock bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Configuration Lock bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Configuration Lock bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO243" description="Configuration Lock bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Configuration Lock bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Configuration Lock bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO246" description="Configuration Lock bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Configuration Lock bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO248" description="Configuration Lock bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO249" description="Configuration Lock bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHCR" width="32" page="0" offset="0x3fc" instances="1" instaddr="4" internal="0" description="GPIO H Lock Commit Register (GPIO224 to 255)">
		<bitfield id="GPIO224" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Configuration lock commit bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Configuration lock commit bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Configuration lock commit bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Configuration lock commit bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Configuration lock commit bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Configuration lock commit bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Configuration lock commit bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Configuration lock commit bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Configuration lock commit bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Configuration lock commit bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="Configuration lock commit bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Configuration lock commit bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Configuration lock commit bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO243" description="Configuration lock commit bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Configuration lock commit bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Configuration lock commit bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO246" description="Configuration lock commit bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Configuration lock commit bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO248" description="Configuration lock commit bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO249" description="Configuration lock commit bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
</module>
